## Необходимый стек технологий: Ngnix, PHP - Laravel, Postgres, Docker

# Задание - создание RESTful API сервиса

Создать RESTful API для одной сущности - **Пост**
Пост обладает следующими атрибутами: ID, Заголовок, Дата публикации, Текст поста
Реализовать следующие RESTful API операции для поста
|  Название                    |HTTP Метод|  Маршрут (URL)      | 
|------------------------------|----------|---------------------|
| Получение списка постов      | `GET`    | `/api/posts`        |
| Получение конкретного поста  | `GET`    | `/api/posts/{post}` |
| Создание поста               | `POST`   | `/api/posts`        |
| Изменение поста              | `PUT`    | `/api/posts/{post}` |
| Удаление поста               | `DELETE` | `/api/posts/{post}` |



Архитектура сервиса: 
Docker контейнер Postgres,
Docker контейнер PHP с установленным Laravel,
Docker контейнер с Ngnix

Отправляя какой-либо API запрос маршрут запроса следующий:
Ngnix docker контейнер принимает запрос и отдает его Laravel приложению,
Приложение Laravel исполняет логику API запроса, обращаясь к контейнеру с Postgres
Получив или изменив данные, ответ возвращается в обратной последовательности.

Готовое задание разместить публичным репозиторием на Github и прислать ссылку на этот репозиторий (очень просим проверить доступность и корректность ссылки на репозиторий)
